'''
Напишите программу, в которой проверяется,
делится ли введенное пользователем число на 3
'''
num = int(input("Введите число: "))
if num%3 == 0:
    print("Ваше число делится на три")
else:
    print("Ваше число не делится на три")
