"""
Вывести строку и число, используя переменные
"""

txt = "Программирую на Python"
print(txt)

num = 123
print("Целое число: ",num)
