'''
Играемся с кортежами
'''
# Создание кортежей:
A=(10,20,30)
print("A:",A)
B=("Python",(1,2))
print("B:",B)
# Вычисление суммы кортежей:
C=A+B
print("C:",C)
# "Добавление" элемента в конец кортежа:
C+=(100,)
print("C:",C)
# "Удаление" элемента кортежа:
C=C[:1]+C[2:]
print("C:",C)
# "Добавление" элемента в начало кортежа:
C=(200,)+C
print("C:",C)
# "Замена" нескольких элементов в кортеже:
C=("A","B")+C[3:]
print("C:",C)
# "Вставка" элементов в кортеж:
C=C[:2]+(8,9)+C[2:]
print("C:",C)
# "Присваивание" значения элементу кортежа:
C=C[:2]+(7,)+C[3:]
print("C:",C)
C= C[:4] + ("Миша",) + C[5:]
print("C:",C)
